# Ultralytics YOLOv11-VisDrone Custom Configuration
nc: 10
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]

backbone:
  # [from, repeats, module, args]
  # 替换原有的 stride=2 Conv 为 SPDConv [cite: 237]
  - [-1, 1, SPDConv, [64]]  # 0-P1/2
  - [-1, 1, SPDConv, [128]] # 1-P2/4
  - [-1, 3, C3k2, [128, False, 0.25]] # 2
  - [-1, 1, SPDConv, [256]] # 3-P3/8
  - [-1, 6, C3k2, [256, False, 0.25]] # 4
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16 (深层可以用普通Conv)
  - [-1, 6, C3k2, [512, False, 0.25]] # 6
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C3k2, [1024, True, 0.25]] # 8
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 1, C2PSA, [1024]] # 10

head:
  # P5 -> P4
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 11
  - [[-1, 6], 1, Concat, [1]] # 12 cat backbone P4
  - [-1, 3, C3k2, [512, False]] # 13

  # P4 -> P3
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 14
  - [[-1, 4], 1, Concat, [1]] # 15 cat backbone P3
  - [-1, 3, C3k2, [256, False]] # 16

  # P3 -> P2 (创新点: P2 Head) [cite: 261]
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 17
  - [[-1, 2], 1, Concat, [1]] # 18 cat backbone P2
  - [-1, 3, C3k2, [128, False]] # 19 (P2 微小目标特征)

  # P2 -> P3
  - [-1, 1, Conv, [256, 3, 2]] # 20
  - [[-1, 16], 1, Concat, [1]] # 21
  - [-1, 3, C3k2, [256, False]] # 22

  # P3 -> P4
  - [-1, 1, Conv, [512, 3, 2]] # 23
  - [[-1, 13], 1, Concat, [1]] # 24
  - [-1, 3, C3k2, [512, False]] # 25

  # P4 -> P5
  - [-1, 1, Conv, [1024, 3, 2]] # 26
  - [[-1, 10], 1, Concat, [1]] # 27
  - [-1, 3, C3k2, [1024, True]] # 28

  # Detect Head (4个检测头: P2, P3, P4, P5)
  - [[19, 22, 25, 28], 1, Detect, [nc]]